app/Controllers/KanbanController.php

SELECT *
FROM `tickets`
WHERE `status` = 's01'
ORDER BY `id` DESC
SELECT *
FROM `tickets`
WHERE `status` = 's02'
ORDER BY `id` DESC
SELECT *
FROM `tickets`
WHERE `status` = 's03'
ORDER BY `id` DESC
---
    public function index()
    {
        $tickets = model(Ticket::class);

        $data = [
            'title' => 'Kanban',
            'ts01'   => $tickets->where('status', 's01')->orderBy('id', 'desc')->findAll(),
            'ts02'   => $tickets->where('status', 's02')->orderBy('id', 'desc')->findAll(),
            'ts03'   => $tickets->where('status', 's03')->orderBy('id', 'desc')->findAll(),