app/Controllers/TicketController.php

    public function index()
    {
        $db = \Config\Database::connect();
        $total = $db->table('tickets')->countAll();
        $tickets = model('Ticket');

        $builder = $db->table('status');
        $builder->join('tickets', 'tickets.status=status.id');
        $status = $builder->get();
        // $status = $builder->where('status.id', 'ASC')->get();

        $data = [
            'title' => 'Tickets de soporte',
            'total' => $total,
            'status' => $status,
            // // 'tickets'   => $tickets->findAll(),
            // 'tickets'   => $tickets->orderBy('status', 'ASC')->findAll()
            'tickets' => $tickets->orderBy('id', 'desc')->findAll()
---
SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT *
FROM `status`
JOIN `tickets` ON `tickets`.`status`=`status`.`id`
SELECT *
FROM `tickets`
ORDER BY `id` DESC

    public function show($id = null)
    {
        $ticket = $this->ticket->find($id);
        if ($ticket) {

            $builder = $this->db->table("status as s");
            $builder->select('s.name');
            $builder->join('tickets as t', 's.id = t.status');
            $st = $builder->get()->getResult();
---
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '21'
SELECT `s`.`name`
FROM `status` as `s`
JOIN `tickets` as `t` ON `s`.`id` = `t`.`status`

    public function delete($id = null)
    {
        $this->ticket->delete($id);
---
DELETE FROM `tickets`
WHERE `id` IN ('21')